fryefryefrye/Decoding-Random-Bluetooth-Address/esp32_get_irk/PlatformIO/get_irk_esp32dev/src/esp32_get_irk.cpp
	// Heart Rate Control Point Characteristic Value
	[HRS_IDX_HR_CTNL_PT_VAL]             =
	{{ESP_GATT_AUTO_RSP}, {ESP_UUID_LEN_16, (uint8_t *)&heart_rate_ctrl_point, ESP_GATT_PERM_WRITE_ENCRYPTED|ESP_GATT_PERM_READ_ENCRYPTED,
	sizeof(uint8_t), sizeof(heart_ctrl_point), (uint8_t *)heart_ctrl_point}},
};

static char *esp_key_type_to_str(esp_ble_key_type_t key_type)
{
	char *key_str = NULL;
	switch(key_type) {
case ESP_LE_KEY_NONE:
	key_str = "ESP_LE_KEY_NONE";
	break;
case ESP_LE_KEY_PENC:
	key_str = "ESP_LE_KEY_PENC";
	break;
case ESP_LE_KEY_PID:
	key_str = "ESP_LE_KEY_PID";
	break;
case ESP_LE_KEY_PCSRK:
	key_str = "ESP_LE_KEY_PCSRK";
	break;
case ESP_LE_KEY_PLK:
	key_str = "ESP_LE_KEY_PLK";
	break;
case ESP_LE_KEY_LLK:
	key_str = "ESP_LE_KEY_LLK";
	break;
case ESP_LE_KEY_LENC:
	key_str = "ESP_LE_KEY_LENC";
	break;
case ESP_LE_KEY_LID:
	key_str = "ESP_LE_KEY_LID";
	break;
case ESP_LE_KEY_LCSRK:
	key_str = "ESP_LE_KEY_LCSRK";
	break;
default:
	key_str = "INVALID BLE KEY TYPE";
	break;

	}

	return key_str;
}

static char *esp_auth_req_to_str(esp_ble_auth_req_t auth_req)
{
	char *auth_str = NULL;
	switch(auth_req) {
case ESP_LE_AUTH_NO_BOND:
	auth_str = "ESP_LE_AUTH_NO_BOND";
	break;
case ESP_LE_AUTH_BOND:
	auth_str = "ESP_LE_AUTH_BOND";
	break;
case ESP_LE_AUTH_REQ_MITM:
	auth_str = "ESP_LE_AUTH_REQ_MITM";
	break;
	//case ESP_LE_AUTH_REQ_BOND_MITM:
	//    auth_str = "ESP_LE_AUTH_REQ_BOND_MITM";
	//    break;
case ESP_LE_AUTH_REQ_SC_ONLY:
	auth_str = "ESP_LE_AUTH_REQ_SC_ONLY";
	break;
case ESP_LE_AUTH_REQ_SC_BOND:
	auth_str = "ESP_LE_AUTH_REQ_SC_BOND";
	break;
case ESP_LE_AUTH_REQ_SC_MITM:
	auth_str = "ESP_LE_AUTH_REQ_SC_MITM";
	break;
case ESP_LE_AUTH_REQ_SC_MITM_BOND:
	auth_str = "ESP_LE_AUTH_REQ_SC_MITM_BOND";
	break;
default:
	auth_str = "INVALID BLE AUTH REQ";
	break;
	}

	return auth_str;
}

static void show_bonded_devices(void)
{
	int dev_num = esp_ble_get_bond_device_num();

	esp_ble_bond_dev_t *dev_list = (esp_ble_bond_dev_t *)malloc(sizeof(esp_ble_bond_dev_t) * dev_num);
	esp_ble_get_bond_device_list(&dev_num, dev_list);
	ESP_LOGI(GATTS_TABLE_TAG, "Bonded devices list : %d", dev_num);
	for (int i = 0; i < dev_num; i++) 
	{
		esp_log_buffer_hex(GATTS_TABLE_TAG, (void *)dev_list[i].bd_addr, sizeof(esp_bd_addr_t));

		printf("Add:");
		for(unsigned char j = 0; j<sizeof(esp_bd_addr_t); j++)
		{
			printf("%02X",*(((uint8_t*)(dev_list[i].bd_addr))+j));
		}
		printf("\r\n");

		printf("IRK:");
		for(unsigned char j = 0; j<sizeof(esp_bt_octet16_t); j++)
		{
			printf(",0x%02X",*(((uint8_t*)(dev_list[i].bond_key.pid_key.irk))+j));
		}
		printf("\r\n");

		printf("IRK, Base64 encoded for the Home Assistant Private BLE Device service: %s\r\n", base64::encode(dev_list[i].bond_key.pid_key.irk, sizeof(esp_bt_octet16_t)).c_str()); 

		printf("IRK,reverse order for Home Assistant ESPrensence:");
		for (unsigned char j = 0; j < sizeof(esp_bt_octet16_t); j++)
		{
			printf("%02X", *(((uint8_t*)(dev_list[i].bond_key.pid_key.irk)) + sizeof(esp_bt_octet16_t) - j -1));
		}
		printf("\r\n");

	}

	free(dev_list);
}

static void __attribute__((unused)) remove_all_bonded_devices(void)
{
	int dev_num = esp_ble_get_bond_device_num();

	esp_ble_bond_dev_t *dev_list = (esp_ble_bond_dev_t *)malloc(sizeof(esp_ble_bond_dev_t) * dev_num);
	esp_ble_get_bond_device_list(&dev_num, dev_list);
	for (int i = 0; i < dev_num; i++) {
		esp_ble_remove_bond_device(dev_list[i].bd_addr);
	}

	free(dev_list);
}

static void gap_event_handler(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param)
{
	esp_err_t ret;

	ESP_LOGV(GATTS_TABLE_TAG, "GAP_EVT, event:%d %s", event,gapEventToString(event));
	//ESP_LOGV(GATTS_TABLE_TAG, "GAP_EVT, event:%d", event);

	switch (event) 
	{
	case ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT:
		adv_config_done &= (~SCAN_RSP_CONFIG_FLAG);
		if (adv_config_done == 0){
			esp_ble_gap_start_advertising(&heart_rate_adv_params);
		}
		break;
	case ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT:
		adv_config_done &= (~ADV_CONFIG_FLAG);
		if (adv_config_done == 0){
			esp_ble_gap_start_advertising(&heart_rate_adv_params);
		}
		break;
	case ESP_GAP_BLE_ADV_START_COMPLETE_EVT:
		//advertising start complete event to indicate advertising start successfully or failed
		if (param->adv_start_cmpl.status != ESP_BT_STATUS_SUCCESS) {
			ESP_LOGE(GATTS_TABLE_TAG, "advertising start failed, error status = %x", param->adv_start_cmpl.status);
			break;
		}
		ESP_LOGI(GATTS_TABLE_TAG, "advertising start success");
		break;
	case ESP_GAP_BLE_PASSKEY_REQ_EVT:                           /* passkey request event */
		ESP_LOGI(GATTS_TABLE_TAG, "ESP_GAP_BLE_PASSKEY_REQ_EVT");
		/* Call the following function to input the passkey which is displayed on the remote device */
		//esp_ble_passkey_reply(heart_rate_profile_tab[HEART_PROFILE_APP_IDX].remote_bda, true, 0x00);
		break;
		//case ESP_GAP_BLE_OOB_REQ_EVT: {
		//    ESP_LOGI(GATTS_TABLE_TAG, "ESP_GAP_BLE_OOB_REQ_EVT");
		//    uint8_t tk[16] = {1}; //If you paired with OOB, both devices need to use the same tk
		//    esp_ble_oob_req_reply(param->ble_security.ble_req.bd_addr, tk, sizeof(tk));
		//    break;
		//}
	case ESP_GAP_BLE_LOCAL_IR_EVT:                               /* BLE local IR event */
		ESP_LOGI(GATTS_TABLE_TAG, "ESP_GAP_BLE_LOCAL_IR_EVT");
		break;
	case ESP_GAP_BLE_LOCAL_ER_EVT:                               /* BLE local ER event */
		ESP_LOGI(GATTS_TABLE_TAG, "ESP_GAP_BLE_LOCAL_ER_EVT");
		break;
	case ESP_GAP_BLE_NC_REQ_EVT:
		/* The app will receive this evt when the IO has DisplayYesNO capability and the peer device IO also has DisplayYesNo capability.
		show the passkey number to the user to confirm it with the number displayed by peer device. */
		esp_ble_confirm_reply(param->ble_security.ble_req.bd_addr, true);
		ESP_LOGI(GATTS_TABLE_TAG, "ESP_GAP_BLE_NC_REQ_EVT, the passkey Notify number:%d", param->ble_security.key_notif.passkey);
		break;
	case ESP_GAP_BLE_SEC_REQ_EVT:
		/* send the positive(true) security response to the peer device to accept the security request.
		If not accept the security request, should send the security response with negative(false) accept value*/
		esp_ble_gap_security_rsp(param->ble_security.ble_req.bd_addr, true);
		break;
	case ESP_GAP_BLE_PASSKEY_NOTIF_EVT:  ///the app will receive this evt when the IO  has Output capability and the peer device IO has Input capability.
		///show the passkey number to the user to input it in the peer device.
		ESP_LOGI(GATTS_TABLE_TAG, "The passkey Notify number:%06d", param->ble_security.key_notif.passkey);
		break;
	case ESP_GAP_BLE_KEY_EVT:
		//shows the ble key info share with peer device to the user.
		ESP_LOGI(GATTS_TABLE_TAG, "key type = %s", esp_key_type_to_str(param->ble_security.ble_key.key_type));
		break;
	case ESP_GAP_BLE_AUTH_CMPL_EVT: 
		esp_bd_addr_t bd_addr;
		memcpy(bd_addr, param->ble_security.auth_cmpl.bd_addr, sizeof(esp_bd_addr_t));
		ESP_LOGI(GATTS_TABLE_TAG, "remote BD_ADDR: %08x%04x",\
			(bd_addr[0] << 24) + (bd_addr[1] << 16) + (bd_addr[2] << 8) + bd_addr[3],
			(bd_addr[4] << 8) + bd_addr[5]);
		ESP_LOGI(GATTS_TABLE_TAG, "address type = %d", param->ble_security.auth_cmpl.addr_type);
		ESP_LOGI(GATTS_TABLE_TAG, "pair status = %s",param->ble_security.auth_cmpl.success ? "success" : "fail");
		if(!param->ble_security.auth_cmpl.success) {
			ESP_LOGI(GATTS_TABLE_TAG, "fail reason = 0x%x",param->ble_security.auth_cmpl.fail_reason);
		} else {
			ESP_LOGI(GATTS_TABLE_TAG, "auth mode = %s",esp_auth_req_to_str(param->ble_security.auth_cmpl.auth_mode));
		}
		show_bonded_devices();
		break;

	case ESP_GAP_BLE_REMOVE_BOND_DEV_COMPLETE_EVT: 
		ESP_LOGD(GATTS_TABLE_TAG, "ESP_GAP_BLE_REMOVE_BOND_DEV_COMPLETE_EVT status = %d", param->remove_bond_dev_cmpl.status);
		ESP_LOGI(GATTS_TABLE_TAG, "ESP_GAP_BLE_REMOVE_BOND_DEV");
		ESP_LOGI(GATTS_TABLE_TAG, "-----ESP_GAP_BLE_REMOVE_BOND_DEV----");
		esp_log_buffer_hex(GATTS_TABLE_TAG, (void *)param->remove_bond_dev_cmpl.bd_addr, sizeof(esp_bd_addr_t));
		ESP_LOGI(GATTS_TABLE_TAG, "------------------------------------");
		break;

