fryefryefrye/Decoding-Random-Bluetooth-Address/esp32_get_irk/PlatformIO/get_irk_esp32dev/src/esp32_get_irk.cpp
	case ESP_GAP_BLE_SET_LOCAL_PRIVACY_COMPLETE_EVT:
		if (param->local_privacy_cmpl.status != ESP_BT_STATUS_SUCCESS){
			ESP_LOGE(GATTS_TABLE_TAG, "config local privacy failed, error status = %x", param->local_privacy_cmpl.status);
			return;
		}

		ret = esp_ble_gap_config_adv_data(&heart_rate_adv_config);
		if (ret){
			ESP_LOGE(GATTS_TABLE_TAG, "config adv data failed, error code = %x", ret);
		}else{
			adv_config_done |= ADV_CONFIG_FLAG;
		}

		ret = esp_ble_gap_config_adv_data(&heart_rate_scan_rsp_config);
		if (ret){
			ESP_LOGE(GATTS_TABLE_TAG, "config adv data failed, error code = %x", ret);
		}else{
			adv_config_done |= SCAN_RSP_CONFIG_FLAG;
		}
		break;

	default:
		ESP_LOGI(GATTS_TABLE_TAG, "event not process");
		break;
	}
}

static void gatts_profile_event_handler(esp_gatts_cb_event_t event,
										esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param)
{
	ESP_LOGV(GATTS_TABLE_TAG, "event = %d  %s",event,gattServerEventTypeToString(event));
	//ESP_LOGV(GATTS_TABLE_TAG, "event = %x",event);
	switch (event) 
	{
	case ESP_GATTS_REG_EVT:
		esp_ble_gap_set_device_name(EXAMPLE_DEVICE_NAME);
		//generate a resolvable random address
		esp_ble_gap_set_rand_addr(rand_addr);
		esp_ble_gap_config_local_privacy(true);
		esp_ble_gatts_create_attr_tab(heart_rate_gatt_db, gatts_if,
			HRS_IDX_NB, HEART_RATE_SVC_INST_ID);
		break;
	case ESP_GATTS_READ_EVT:
		break;
	case ESP_GATTS_WRITE_EVT:
		ESP_LOGI(GATTS_TABLE_TAG, "ESP_GATTS_WRITE_EVT, write value:");
		esp_log_buffer_hex(GATTS_TABLE_TAG, param->write.value, param->write.len);
		break;
	case ESP_GATTS_EXEC_WRITE_EVT:
		break;
	case ESP_GATTS_MTU_EVT:
		break;
	case ESP_GATTS_CONF_EVT:
		break;
	case ESP_GATTS_UNREG_EVT:
		break;
	case ESP_GATTS_DELETE_EVT:
		break;
	case ESP_GATTS_START_EVT:
		break;
	case ESP_GATTS_STOP_EVT:
		break;
	case ESP_GATTS_CONNECT_EVT:
		ESP_LOGI(GATTS_TABLE_TAG, "ESP_GATTS_CONNECT_EVT");
		/* start security connect with peer device when receive the connect event sent by the master */
		esp_ble_set_encryption(param->connect.remote_bda, ESP_BLE_SEC_ENCRYPT_MITM);
		break;
	case ESP_GATTS_DISCONNECT_EVT:
		ESP_LOGI(GATTS_TABLE_TAG, "ESP_GATTS_DISCONNECT_EVT, disconnect reason 0x%x", param->disconnect.reason);
		/* start advertising again when missing the connect */
		esp_ble_gap_start_advertising(&heart_rate_adv_params);
		break;
	case ESP_GATTS_OPEN_EVT:
		break;
	case ESP_GATTS_CANCEL_OPEN_EVT:
		break;
	case ESP_GATTS_CLOSE_EVT:
		break;
	case ESP_GATTS_LISTEN_EVT:
		break;
	case ESP_GATTS_CONGEST_EVT:
		break;
	case ESP_GATTS_CREAT_ATTR_TAB_EVT: {
		ESP_LOGI(GATTS_TABLE_TAG, "The number handle = %x",param->add_attr_tab.num_handle);
		if (param->create.status == ESP_GATT_OK){
			if(param->add_attr_tab.num_handle == HRS_IDX_NB) {
				memcpy(heart_rate_handle_table, param->add_attr_tab.handles,
					sizeof(heart_rate_handle_table));
				esp_ble_gatts_start_service(heart_rate_handle_table[HRS_IDX_SVC]);
			}else{
				ESP_LOGE(GATTS_TABLE_TAG, "Create attribute table abnormally, num_handle (%d) doesn't equal to HRS_IDX_NB(%d)",
					param->add_attr_tab.num_handle, HRS_IDX_NB);
			}
		}else{
			ESP_LOGE(GATTS_TABLE_TAG, " Create attribute table failed, error code = %x", param->create.status);
		}
		break;
									   }

	default:
		ESP_LOGI(GATTS_TABLE_TAG, "event not process");
		break;
	}
}


static void gatts_event_handler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if,
								esp_ble_gatts_cb_param_t *param)
{

	/* If event is register event, store the gatts_if for each profile */
	if (event == ESP_GATTS_REG_EVT) {
		if (param->reg.status == ESP_GATT_OK) {
			heart_rate_profile_tab[HEART_PROFILE_APP_IDX].gatts_if = gatts_if;
		} else {
			ESP_LOGI(GATTS_TABLE_TAG, "Reg app failed, app_id %04x, status %d\n",
				param->reg.app_id,
				param->reg.status);
			return;
		}
	}

	do {
		int idx;
		for (idx = 0; idx < HEART_PROFILE_NUM; idx++) {
			if (gatts_if == ESP_GATT_IF_NONE || /* ESP_GATT_IF_NONE, not specify a certain gatt_if, need to call every profile cb function */
				gatts_if == heart_rate_profile_tab[idx].gatts_if) {
					if (heart_rate_profile_tab[idx].gatts_cb) {
						heart_rate_profile_tab[idx].gatts_cb(event, gatts_if, param);
					}
			}
		}
	} while (0);
}

void setup()
{


	heart_rate_adv_config.set_scan_rsp = false;
	heart_rate_adv_config.include_txpower = true;
	heart_rate_adv_config.min_interval = 0x0006; //slave connection min interval; Time = min_interval * 1.25 msec
	heart_rate_adv_config.max_interval = 0x0010; //slave connection max interval; Time = max_interval * 1.25 msec
	heart_rate_adv_config.appearance = 0x00;
	heart_rate_adv_config.manufacturer_len = 0; //TEST_MANUFACTURER_DATA_LEN;
	heart_rate_adv_config.p_manufacturer_data =  NULL; //&test_manufacturer[0];
	heart_rate_adv_config.service_data_len = 0;
	heart_rate_adv_config.p_service_data = NULL;
	heart_rate_adv_config.service_uuid_len = sizeof(sec_service_uuid);
	heart_rate_adv_config.p_service_uuid = sec_service_uuid;
	heart_rate_adv_config.flag = (ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT);



	heart_rate_scan_rsp_config.set_scan_rsp = true;
	heart_rate_scan_rsp_config.include_name = true;
	heart_rate_scan_rsp_config.manufacturer_len = sizeof(test_manufacturer);
	heart_rate_scan_rsp_config.p_manufacturer_data = test_manufacturer;

	heart_rate_adv_params.adv_int_min        = 0x100;
	heart_rate_adv_params.adv_int_max        = 0x100;
	heart_rate_adv_params.adv_type           = ADV_TYPE_IND;
	heart_rate_adv_params.own_addr_type      = BLE_ADDR_TYPE_RANDOM;
	heart_rate_adv_params.channel_map        = ADV_CHNL_ALL;
	heart_rate_adv_params.adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY;


	BT_Init();

}

void loop() 
{
	//delay(1000);
}

void BT_Init()
{
	ESP_LOGE(GATTS_TABLE_TAG, "GATTS Starting...");

	btStart();

	esp_err_t errRc = ESP_OK;

	if(nvs_flash_init() != ESP_OK)
	{
		printf("nvs_flash_init failed \r\n");
	}  

	esp_bluedroid_status_t bt_state = esp_bluedroid_get_status();

	if (bt_state == ESP_BLUEDROID_STATUS_UNINITIALIZED) {
		if(esp_bluedroid_init() != ESP_OK)
		{
			printf("esp_bluedroid_init failed \r\n");
		}  
	}

	if (bt_state != ESP_BLUEDROID_STATUS_ENABLED) {
		if(esp_bluedroid_enable() != ESP_OK)
		{
			printf("esp_bluedroid_enable failed \r\n");
		}  
	}

	esp_err_t ret;

	ret = esp_ble_gatts_register_callback(gatts_event_handler);
	if (ret){
		ESP_LOGE(GATTS_TABLE_TAG, "gatts register error, error code = %x", ret);
		return;
	}
	ret = esp_ble_gap_register_callback(gap_event_handler);
	if (ret){
		ESP_LOGE(GATTS_TABLE_TAG, "gap register error, error code = %x", ret);
		return;
	}
	ret = esp_ble_gatts_app_register(ESP_HEART_RATE_APP_ID);
	if (ret){
		ESP_LOGE(GATTS_TABLE_TAG, "gatts app register error, error code = %x", ret);
		return;
	}

